20260824/20260824/InformationRegisters/СБ_ПоставщикиПоТоварнымКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СБ_ПоставщикиПоТоварнымКатегориям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньЗначимости</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СБ_КатегорииМатериалов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

20260824/20260824/InformationRegisters/СБ_ПоставщикиПоТоварнымКатегориям/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ОтборПоГруппеНоменклатурыАктивен",
	Ложь);      
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ОтборПоГруппеНоменклатуры",
	Неопределено);    
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ОтборПоТоварнойКатегорииАктивен",
	Ложь);      
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	"ОтборПоТоварнойКатегории",
	Неопределено);
	
	//Попытка  
	//	
	//	ОтборПоНоменклатуре = ЭтотОбъект.Параметры.Номенклатура;
	//	
	//	Если ЗначениеЗаполнено(ЭтотОбъект.Параметры.НоменклатураГруппаНоменклатуры) Тогда 
	//		
	//		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	//		"ОтборПоГруппеНоменклатурыАктивен",
	//		Истина);      
	//		
	//		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	//		"ОтборПоГруппеНоменклатуры",
	//		ЭтотОбъект.Параметры.НоменклатураГруппаНоменклатуры);
	//		
	//	КонецЕсли; 
	//	
	//	Если ЗначениеЗаполнено(ЭтотОбъект.Параметры.НоменклатураТоварнаяКатегория) Тогда 
	//		
	//		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	//		"ОтборПоТоварнойКатегорииАктивен",
	//		Истина);      
	//		
	//		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
	//		"ОтборПоТоварнойКатегории",
	//		ЭтотОбъект.Параметры.НоменклатураТоварнаяКатегория);
	//		
	//	КонецЕсли;  
	
	//Исключение
	//	Возврат;	
	//КонецПопытки;   
	
	Если Параметры.Свойство("Номенклатура") Тогда
		НоменклатураРодитель = Параметры.Номенклатура;	
	КонецЕсли;
	
	Если Параметры.Свойство("КатегорияМатериала") Тогда
		КатегорияМатериала = Параметры.КатегорияМатериала;
	КонецЕсли;   
	
	Если Параметры.Свойство("НоменклатураГруппаНоменклатуры") Тогда
		
		ГруппаНоменклатуры = Параметры.НоменклатураГруппаНоменклатуры;
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"ОтборПоГруппеНоменклатурыАктивен",
		Истина);      
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"ОтборПоГруппеНоменклатуры",
		Этотобъект.Параметры.НоменклатураГруппаНоменклатуры); 
		
	КонецЕсли; 
	
	Если Параметры.Свойство("НоменклатураТоварнаяКатегория") Тогда
		
		КатегорияМатериала = Параметры.НоменклатураТоварнаяКатегория;
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"ОтборПоТоварнойКатегорииАктивен",
		Истина);      
		
		ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Список,
		"ОтборПоТоварнойКатегории",
		ЭтотОбъект.Параметры.НоменклатураТоварнаяКатегория);
		
	КонецЕсли;
	
	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)  
	
	Отказ = Истина;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Номенклатура", НоменклатураРодитель);
	ЗначенияЗаполнения.Вставить("КатегорияМатериала", КатегорияМатериала);
	ЗначенияЗаполнения.Вставить("ГруппаНоменклатуры", ГруппаНоменклатуры);
	
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если ТипЗнч(ЭлементОтбора.ПравоеЗначение) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			ЗначенияЗаполнения.Вставить("Договор", ЭлементОтбора.ПравоеЗначение);		
		КонецЕсли;
	КонецЦикла;

	
	ОткрытьФорму("РегистрСведений.СБ_ПоставщикиПоТоварнымКатегориям.ФормаЗаписи",
	Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения),
	ЭтаФорма);
	
КонецПроцедуры
